Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/witnesses/rules_relating_to_your_evidence.html.txt.tmx
Source language: en
Languages: ga

source: Rules relating to your evidence
ga: Rialacha a bhaineann le d'fhianaise

source: While you are giving evidence, the lawyers and the judge may object to certain things that you say
ga: Nuair atá fianaise dhá thabhairt agat, d'fhéadfadh na dlíodóirí agus an breitheamh dul i gcoinne rudaí áirid a deireann tú

source: This is because there are legal rules relating to what evidence you may give
ga: Tarlaíonn seo mar gheall go bhfuil rialacha dlíthiúla ann a bhaineann leis an bhfianaise gur féidir leat a thabhairt

source: The judge may interrupt you and ask you to stop if one of the rules of evidence is being broken
ga: D'fhéadfadh sé go gcuirfeadh an breitheamh isteach ar do chuid cainte agus iarradh ort stopadh má tá ceann de rialacha na fianaise dhá bhriseadh agat

source: As a witness, you may only give evidence about facts within your own personal knowledge
ga: Mar fhinné, ní féidir leat fianaise a thabhairt ach ar fhíricí a bhfuil eolas pearsanta agat féin orthu

source: You cannot testify as to what somebody else saw or heard
ga: Ní féidir leat fianaise a thabhairt maidir le rud a chonaic nó a chuala duine eile

source: You may not give evidence about your opinion
ga: Ní féidir leat fianaise a thabhairt maidir le do thuairim

source: You must confine your testimony to a statement of the facts, not any assumptions you have made or conclusions you have drawn from those facts
ga: Ní mór duit cloí i do chuid fianaise leis na fíricí, ní féidir aon bharúil ná cinneadh atá déanta agat féin ó na fíricí sin a thabhairt mar fhianaise

source: The exception to this rule is the expert witness who may give evidence as to his or her opinion
ga: Eisceacht amháin don riail seo é/í an finné saineolaí a bhfuil sé de chead aige/aici fianaise a thabhairt maidir lena t(h)uairim féin

source: You may not give evidence about what someone else said
ga: Ní féidir leat fianaise a thabhairt maidir le rud a dúirt duine eile

source: This is known as the hearsay rule
ga: Tugtar an riail clostráchta ar seo

source: For example, you may not give evidence that your mother told you she saw the accused grab your purse
ga: Mar shampla, ní féidir leat fianaise a thabhairt gur dhúirt do mháthair leat go bhfaca sí an té atá cúisithe ag tógáil do sparáin

source: In that case your mother must herself give evidence in court that she saw the accused grab your purse
ga: Sa chás sin ní mór do do mháthair í féin fianaise a thabhairt sa chúirt go bhfaca sí an té atá cúisithe ag tógáil do sparáin

source: You may not give evidence about previous statements you have made
ga: Ní féidir leat fianaise a thabhairt a bhaineann le ráitis a thug tú cheana

source: For example, you cannot give evidence that you told your friend that the accused grabbed your purse
ga: Mar shampla, ní féidir leat fianaise a thabhairt gur dhúirt tú le cara gur thóg an té atá cúisithe do sparán

source: You may only give evidence about the actual incident
ga: Ní féidir leat fianaise a thabhairt ach maidir leis an rud a tharla

source: There is one exception to this rule; if you are giving evidence as a victim of rape, you are allowed to introduce evidence that you made a complaint after the rape
ga: Níl ach eisceacht amháin don riail seo: má tá fianaise dhá thabhairt agat mar dhuine a d'fhulaing éigniú, is féidir leat fianaise a thabhairt gur dhein tú gearán tar éis an éignithe

source: Your main duty as a witness is to tell the truth to the court
ga: Tá sé mar phríomhdhualgas ar fhinné an fhírinne a insint sa chúirt

source: If you knowingly make a false statement under oath, you may have committed the crime of "perjury" and you may be prosecuted
ga: Má thugann tú fianaise bhréige sa chúirt agus fios agat go bhfuil sé bréagach agus tú faoi mhionn, d'fhéadfadh sé go mbeadh coir na fianaise bréige déanta agat agus is féidir tú a chúisiú

source: Right to refuse to answer a question
ga: An ceart diúltú ceist a fhreagairt

source: If you are giving evidence (either during the examination or the cross-examination), and you do not wish to answer a particular question, you must indicate to the judge that you are not prepared to answer the question and why
ga: Má tá fianaise dhá thabhairt agat (nuair atá tú dhá cheistiú nó dhá chros-cheistiú), agus muna mian leat ceist faoi leith a fhreagairt, caithfidh tú a chur in iúl don bhreitheamh nach bhfuil tú sásta an cheist a fhreagairt agus cén fáth

source: There are very few circumstances where a judge will allow you to refuse to answer a question if it is relevant to the case
ga: Tá beagán cúinsí ann ina dtabharfaidh an breitheamh cead duit gan ceist a fhreagairt má bhaineann sí leis an gcás

source: The right to refuse is known as a privilege:
ga: Tugtar pribhléid ar an gceart atá agat diúltú ceist a fhreagairt:

source: • You have a "privilege against self-incrimination"
ga: • Tá pribhléid agat maidir le féinchiontú

source: This means that you can refuse to answer questions or hand over documents that may implicate you in criminal proceedings
ga: Ciallaíonn sé seo gur féidir leat diúltú ceisteanna a fhreagairt nó cáipéisí a chur ar fáil a d'fhéadfadh tú féin a chiontú in imeachtaí coiriúla

source: • You may have a "legal professional privilege"
ga: • D'fhéadfadh sé go bhfuil pribhléid den ghairm dlíthiúil agat

source: A legal advisor and his or her client cannot be forced to disclose communications between them
ga: Ní féidir iallach a chur ar chomhairleoir dlí ná ar a c(h)liant aon eolas a d'inis siad dhá chéile a chur ar fáil

source: If any communication is made in contemplation of litigation (i.e., with a court case in mind), then that communication is also privileged
ga: Má dhéantar aon chumarsáid eatarthu agus iad ag súil le dul chun dlí (i.e., le cás cúirte ar intinn), baineann pribhléid leis an gcumarsáid sin sa chás seo

source: • Priests are allowed to refuse to answer questions relating to what was said in the confessional
ga: • Tá sé de cheart ag sagairt diúltú ceisteanna a fhreagairt maidir le rudaí a dúradh leo sa bhosca faoistine

source: This is known as the "sacerdotal privilege"
ga: Tugtar pribhléid sagartúil ar seo

source: Similarly, communications with a counsellor may also be privileged
ga: Chomh maith leis sin, d'fhéadfadh comhráite le comhairleoir a bheith faoi phribhléid freisin

source: When you have voiced your objection to answering a particular question, the judge will then decide whether or not you must answer the question
ga: Nuair atá sé curtha in iúl agat nach bhfuil tú sásta ceist faoi leith a fhreagairt, déanfaidh an breitheamh cinneadh an gá duit an cheist a fhreagairt

source: If the judge decides that you cannot rely on a "privilege", then you must answer the question
ga: Má dhéanann an breitheamh cinneadh nach mbaineann pribhléid leis an gceist, ní mór duit í a fhreagairt

source: If you fail to do so, you will be in contempt of court and you may be imprisoned
ga: Má theipeann ort, cuirfear díspeagadh cúirte i do leith agus d'fhéadfaí téarma príosúnachta a ghearradh ort

source: For more detailed information you should seek legal advice
ga: Ba chóir duit comhairle dlí a lorg chun faisnéis mionsonraithe a fháil
